[
  {
    "name": "Amazon.com, Inc.",
    "description": "Amazon.com, Inc. engages in the retail sale of consumer products and subscriptions through online and physical stores in North America and internationally. It operates through three segments: North America, International, and Amazon Web Services (AWS). The company's products offered through its stores include merchandise and content purchased for resale; and products offered by third-party sellers. It also manufactures and sells electronic devices, including Kindle, Fire tablets, Fire TVs, Rings, Blink, eero, and Echo; and develops and produces media content. In addition, the company offers programs that enable sellers to sell their products in its stores; and programs that allow authors, musicians, filmmakers, Twitch streamers, skill and app developers, and others to publish and sell content. Further, it provides compute, storage, database, analytics, machine learning, and other services, as well as fulfillment, advertising, and digital content subscriptions. Additionally, the company offers Amazon Prime, a membership program. It serves consumers, sellers, developers, enterprises, content creators, and advertisers. The company was incorporated in 1994 and is headquartered in Seattle, Washington.",
    "industry": "Internet Retail",
    "ticker": "AMZN",
    "controversy": 3,
    "esg": 30,
    "esgEnvironment": 5.6,
    "esgSocial": 14.8,
    "esgGovernance": 9.9,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a9/Amazon_logo.svg/640px-Amazon_logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["amazon"]
  },
  {
    "name": "Apple Inc.",
    "description": "Apple Inc. designs, manufactures, and markets smartphones, personal computers, tablets, wearables, and accessories worldwide. The company offers iPhone, a line of smartphones; Mac, a line of personal computers; iPad, a line of multi-purpose tablets; and wearables, home, and accessories comprising AirPods, Apple TV, Apple Watch, Beats products, and HomePod. It also provides AppleCare support and cloud services; and operates various platforms, including the App Store that allow customers to discover and download applications and digital content, such as books, music, video, games, and podcasts. In addition, the company offers various services, such as Apple Arcade, a game subscription service; Apple Fitness+, a personalized fitness service; Apple Music, which offers users a curated listening experience with on-demand radio stations; Apple News+, a subscription news and magazine service; Apple TV+, which offers exclusive original content; Apple Card, a co-branded credit card; and Apple Pay, a cashless payment service, as well as licenses its intellectual property. The company serves consumers, and small and mid-sized businesses; and the education, enterprise, and government markets. It distributes third-party applications for its products through the App Store. The company also sells its products through its retail and online stores, and direct sales force; and third-party cellular network carriers, wholesalers, retailers, and resellers. Apple Inc. was incorporated in 1977 and is headquartered in Cupertino, California.",
    "industry": "Consumer Electronics",
    "ticker": "AAPL",
    "controversy": 3,
    "esg": 17,
    "esgEnvironment": 0.6,
    "esgSocial": 6.9,
    "esgGovernance": 9.2,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fa/Apple_logo_black.svg/391px-Apple_logo_black.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["apple"]
  },
  {
    "name": "Bank of America Corporation",
    "description": "Bank of America Corporation, through its subsidiaries, provides banking and financial products and services for individual consumers, small and middle-market businesses, institutional investors, large corporations, and governments worldwide. Its Consumer Banking segment offers traditional and money market savings accounts, certificates of deposit and IRAs, noninterest-and interest-bearing checking accounts, and investment accounts and products; and credit and debit cards, residential mortgages, and home equity loans, as well as direct and indirect loans, such as automotive, recreational vehicle, and consumer personal loans. The company's Global Wealth & Investment Management segment offers investment management, brokerage, banking, and trust and retirement products and services; and wealth management solutions, as well as customized solutions, including specialty asset management services. Its Global Banking segment provides lending products and services, including commercial loans, leases, commitment facilities, trade finance, and commercial real estate and asset-based lending; treasury solutions, such as treasury management, foreign exchange, and short-term investing options and merchant services; working capital management solutions; and debt and equity underwriting and distribution, and merger-related and other advisory services. The company's Global Markets segment offers market-making, financing, securities clearing, settlement, and custody services, as well as risk management products using interest rate, equity, credit, currency and commodity derivatives, foreign exchange, fixed-income, and mortgage-related products. The company was founded in 1784 and is based in Charlotte, North Carolina.",
    "industry": "Banks",
    "ticker": "BAC",
    "controversy": 3,
    "esg": 27,
    "esgEnvironment": 1.6,
    "esgSocial": 14.4,
    "esgGovernance": 11.2,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/b/b6/Of_america_22121221221.png",
    "lastUpdated": 1661141873,
    "binding": ["bankofamerica"]
  },
  {
    "name": "The Boeing Company",
    "description": "The Boeing Company, together with its subsidiaries, designs, develops, manufactures, sells, services, and supports commercial jetliners, military aircraft, satellites, missile defense, human space flight and launch systems, and services worldwide. The company operates through four segments: Commercial Airplanes; Defense, Space & Security; Global Services; and Boeing Capital. The Commercial Airplanes segment develops, produces, and markets commercial jet aircraft for passenger and cargo requirements, as well as provides fleet support services. The Defense, Space & Security segment engages in the research, development, production, and modification of manned and unmanned military aircraft and weapons systems; strategic defense and intelligence systems, which include strategic missile and defense systems, command, control, communications, computers, intelligence, surveillance and reconnaissance, cyber and information solutions, and intelligence systems; and satellite systems, such as government and commercial satellites, and space exploration. The Global Services segment offers products and services, including supply chain and logistics management, engineering, maintenance and modifications, upgrades and conversions, spare parts, pilot and maintenance training systems and services, technical and maintenance documents, and data analytics and digital services to commercial and defense customers. The Boeing Capital segment offers financing services and manages financing exposure for a portfolio of equipment under operating leases, sales-type/finance leases, notes and other receivables, assets held for sale or re-lease, and investments. The company was incorporated in 1916 and is based in Arlington, Virginia.",
    "industry": "Aerospace & Defense",
    "ticker": "BA",
    "controversy": 4,
    "esg": 35,
    "esgEnvironment": 7.1,
    "esgSocial": 19.7,
    "esgGovernance": 7.9,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4f/Boeing_full_logo.svg/512px-Boeing_full_logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["boeing", "boeing_text"]
  },
  {
    "name": "Chevron Corporation",
    "description": "Chevron Corporation, through its subsidiaries, engages in the integrated energy and chemicals operations in the United States and internationally. The company operates in two segments, Upstream and Downstream. The Upstream segment is involved in the exploration, development, production, and transportation of crude oil and natural gas; liquefaction, transportation, and regasification associated with liquefied natural gas; transportation of crude oil through pipelines; and processing, transportation, storage, and marketing of natural gas, as well as a gas-to-liquids plant. The Downstream segment refines crude oil into petroleum products; markets crude oil, refined products, and lubricants; manufactures and markets renewable fuels; transports crude oil and refined products by pipeline, marine vessel, motor equipment, and rail car; and manufactures and markets commodity petrochemicals, plastics for industrial uses, and fuel and lubricant additives. The company was formerly known as ChevronTexaco Corporation and changed its name to Chevron Corporation in 2005. Chevron Corporation was founded in 1879 and is headquartered in San Ramon, California.",
    "industry": "Oil & Gas Integrated",
    "ticker": "CVX",
    "controversy": 3,
    "esg": 38,
    "esgEnvironment": 18.6,
    "esgSocial": 8.7,
    "esgGovernance": 10.3,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/86/Chevron_Logo.svg/430px-Chevron_Logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["chevron"]
  },
  {
    "name": "Cisco Systems, Inc.",
    "description": "Cisco Systems, Inc. designs, manufactures, and sells Internet Protocol based networking and other products related to the communications and information technology industry in the Americas, Europe, the Middle East, Africa, the Asia Pacific, Japan, and China. The company also offers switching portfolio encompasses campus switching as well as data center switching; enterprise routing portfolio interconnects public and private wireline and mobile networks, delivering highly secure, and reliable connectivity to campus, data center and branch networks; wireless products include wireless access points that are standalone, controller appliance-based, switch-converged, and Meraki cloud-managed offerings; and compute portfolio including the cisco unified computing system, hyperflex, and software management capabilities, which combine computing, networking, and storage infrastructure management and virtualization. In addition, it provides Internet for the future product consists of routed optical networking, 5G, silicon, and optics solutions; collaboration products, such as meetings, collaboration devices, calling, contact center, and communication platform as a service; end-to-end security product consists of network security, cloud security, security endpoints, unified threat management, and zero trust; and optimized application experiences products including full stack observability and cloud-native platform. Further, the company offers a range of service and support options for its customers, including technical support and advanced services and advisory services. It serves businesses of various sizes, public institutions, governments, and service providers. The company sells its products and services directly, as well as through systems integrators, service providers, other resellers, and distributors. Cisco Systems, Inc. has strategic alliances with other companies. Cisco Systems, Inc. was incorporated in 1984 and is headquartered in San Jose, California.",
    "industry": "Communication Equipment",
    "ticker": "CSCO",
    "controversy": 2,
    "esg": 12,
    "esgEnvironment": 0,
    "esgSocial": 5.6,
    "esgGovernance": 6.4,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/1/14/Cisco_logo.jpg",
    "lastUpdated": 1661141873,
    "binding": ["cisco"]
  },
  {
    "name": "The Gap, Inc.",
    "description": "The Gap, Inc. operates as an apparel retail company. The company offers apparel, accessories, and personal care products for men, women, and children under the Old Navy, Gap, Banana Republic, and Athleta brands. Its products include denim and khakis; eyewear, jewelry, shoes, handbags, and fragrances; and fitness and lifestyle products for use in yoga, training, sports, travel, and everyday activities for women and girls. The company offers its products through company-operated stores, franchise stores, websites, and third-party arrangements. It has franchise agreements to operate Old Navy, Gap, Banana Republic, and Athleta stores and websites in Asia, Europe, Latin America, the Middle East, and Africa. The company also provides its products through e-commerce sites. The Gap, Inc. was incorporated in 1969 and is headquartered in San Francisco, California.",
    "industry": "Apparel Retail",
    "ticker": "GPS",
    "controversy": 3,
    "esg": 16,
    "esgEnvironment": 1.2,
    "esgSocial": 9.1,
    "esgGovernance": 5.3,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/69/Gap_logo.svg/480px-Gap_logo.svg.png",
    "lastUpdated": 1674364673,
    "binding": ["gap"]
  },
  {
    "name": "Meta Platforms, Inc.",
    "description": "Meta Platforms, Inc. engages in the development of products that enable people to connect and share with friends and family through mobile devices, personal computers, virtual reality headsets, and wearables worldwide. It operates in two segments, Family of Apps and Reality Labs. The Family of Apps segment offers Facebook, which enables people to share, discuss, discover, and connect with interests; Instagram, a community for sharing photos, videos, and private messages, as well as feed, stories, reels, video, live, and shops; Messenger, a messaging application for people to connect with friends, family, communities, and businesses across platforms and devices through text, audio, and video calls; and WhatsApp, a messaging application that is used by people and businesses to communicate and transact privately. The Reality Labs segment provides augmented and virtual reality related products comprising consumer hardware, software, and content that help people feel connected, anytime, and anywhere. The company was formerly known as Facebook, Inc. and changed its name to Meta Platforms, Inc. in October 2021. Meta Platforms, Inc. was incorporated in 2004 and is headquartered in Menlo Park, California.",
    "industry": "Internet Content & Information",
    "ticker": "META",
    "controversy": 4,
    "esg": 33,
    "esgEnvironment": 1,
    "esgSocial": 21,
    "esgGovernance": 10.5,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/8/87/Facebook_Logo_%282015%29_light.svg/640px-Facebook_Logo_%282015%29_light.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["facebook"]
  },
  {
    "name": "International Business Machines Corporation",
    "description": "International Business Machines Corporation, together with its subsidiaries, provides integrated solutions and services worldwide. The company operates through four business segments: Software, Consulting, Infrastructure, and Financing. The Software segment offers hybrid cloud platform and software solutions; software for business automation, AIOps and management, integration, and application servers; data and artificial intelligence solutions; and security software and services for threat, data, and identity. This segment also provides transaction processing software that supports clients' mission-critical and on-premise workloads in banking, airlines, and retail industries. The Consulting segment offers business transformation services, including strategy, business process design and operations, data and analytics, and system integration services; technology consulting services; and application and cloud platform services. The Infrastructure segment provides on-premises and cloud-based server and storage solutions for its clients' mission-critical and regulated workloads; and support services and solutions for hybrid cloud infrastructure, as well as remanufacturing and remarketing services for used equipment. The Financing segment offers lease, installment payment, loan financing, and short-term working capital financing services. The company has collaboration agreement with Siemens Digital Industri Software to develop a combined software solution. The company was formerly known as Computing-Tabulating-Recording Co. International Business Machines Corporation was incorporated in 1911 and is headquartered in Armonk, New York.",
    "industry": "Information Technology Services",
    "ticker": "IBM",
    "controversy": 2,
    "esg": 15,
    "esgEnvironment": 0.5,
    "esgSocial": 6.7,
    "esgGovernance": 7.6,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/fc/IBM_logo_in.jpg/640px-IBM_logo_in.jpg",
    "lastUpdated": 1661141873,
    "binding": ["ibm"]
  },
  {
    "name": "Intel Corporation",
    "description": "Intel Corporation designs, develops, manufactures, markets, and sells computing and related products worldwide. It operates through Client Computing Group, Data Center and AI, Network and Edge, Mobileye, Accelerated Computing Systems and Graphics, Intel Foundry Services, and Other segments. The company offers platform products, such as central processing units and chipsets, and system-on-chip and multichip packages; and accelerators, boards and systems, connectivity products, and memory and storage products. It also provides high-performance compute solutions for targeted verticals and embedded applications for retail, industrial, and healthcare markets; and solutions for assisted and autonomous driving comprising compute platforms, computer vision and machine learning-based sensing, mapping and localization, driving policy, and active sensors. In addition, the company offers workload-optimized platforms and related products for cloud service providers, enterprise and government, and communications service providers. It serves original equipment manufacturers, original design manufacturers, cloud service providers, and other equipment manufacturers. The company was incorporated in 1968 and is headquartered in Santa Clara, California.",
    "industry": "Semiconductors",
    "ticker": "INTC",
    "controversy": 3,
    "esg": 17,
    "esgEnvironment": 4.4,
    "esgSocial": 5.9,
    "esgGovernance": 7,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/7/7d/Intel_logo_%282006-2020%29.svg/640px-Intel_logo_%282006-2020%29.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["intel"]
  },
  {
    "name": "The Hershey Company",
    "description": "The Hershey Company, together with its subsidiaries, engages in the manufacture and sale of confectionery products and pantry items in the United States and internationally. The company operates through three segments: North America Confectionery, North America Salty Snacks, and International. It offers chocolate and non-chocolate confectionery products; gum and mint refreshment products, including mints, chewing gums, and bubble gums; pantry items, such as baking ingredients, toppings, beverages, and sundae syrups; and snack items comprising spreads, bars, snack bites, mixes, popcorn, and pretzels. The company provides its products primarily under the Hershey's, Reese's, Kisses, Jolly Rancher, Almond Joy, Brookside, barkTHINS, Cadbury, Good & Plenty, Heath, Kit Kat, Payday, Rolo, Twizzlers, Whoppers, York, Ice Breakers, Breath Savers, Bubble Yum, Lily's, SkinnyPop, Pirates Booty, Paqui, Dot's Homestyle Pretzels, and ONE Bar brands, as well as under the Pelon Pelo Rico, IO-IO, and Sofit brands. It markets and sells its products to wholesale distributors, chain grocery stores, mass merchandisers, chain drug stores, vending companies, wholesale clubs, convenience stores, dollar stores, concessionaires, and department stores. The company was founded in 1894 and is headquartered in Hershey, Pennsylvania.",
    "industry": "Confectioners",
    "ticker": "HSY",
    "controversy": 3,
    "esg": 27,
    "esgEnvironment": 11.3,
    "esgSocial": 10.9,
    "esgGovernance": 5.2,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d9/Hershey_company_textlogo.svg/640px-Hershey_company_textlogo.svg.png",
    "lastUpdated": 1674364673,
    "binding": ["hersheys"]
  },
  {
    "name": "McDonald's Corporation",
    "description": "McDonald's Corporation operates and franchises McDonald's restaurants in the United States and internationally. The company's restaurants offer hamburgers and cheeseburgers, chicken sandwiches and nuggets, fries, salads, shakes, frozen desserts, sundaes, soft serve cones, bakery items, soft drinks, coffee, and beverages and other beverages, as well as breakfast menu, including muffins, Sausages, biscuit and bagel sandwiches, oatmeal, hash browns, breakfast burritos and hotcakes. McDonald's Corporation was founded in 1940 and is headquartered in Chicago, Illinois.",
    "industry": "Restaurants",
    "ticker": "MCD",
    "controversy": 3,
    "esg": 25,
    "esgEnvironment": 4.2,
    "esgSocial": 14.3,
    "esgGovernance": 6.3,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4b/McDonald%27s_logo.svg/634px-McDonald%27s_logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["mcdonalds", "mcdonalds_text"]
  },
  {
    "name": "Oracle Corporation",
    "description": "Oracle Corporation offers products and services that address enterprise information technology environments worldwide. Its Oracle cloud software as a service offering include various cloud software applications, including Oracle Fusion cloud enterprise resource planning (ERP), Oracle Fusion cloud enterprise performance management, Oracle Fusion cloud supply chain and manufacturing management, Oracle Fusion cloud human capital management, Oracle Advertising, and NetSuite applications suite, as well as Oracle Fusion Sales, Service, and Marketing. The company also offers cloud-based industry solutions for various industries; Oracle application licenses; and Oracle license support services. In addition, it provides cloud and license business' infrastructure technologies, such as the Oracle Database, an enterprise database; Java, a software development language; and middleware, including development tools and others. The company's cloud and license business' infrastructure technologies also comprise cloud-based compute, storage, and networking capabilities; and Oracle autonomous database, MySQL HeatWave, Internet-of-Things, digital assistant, and blockchain. Further, it provides hardware products and other hardware-related software offerings, including Oracle engineered systems, enterprise servers, storage solutions, industry-specific hardware, virtualization software, operating systems, management software, and related hardware services; and consulting and customer services. The company markets and sells its cloud, license, hardware, support, and services offerings directly to businesses in various industries, government agencies, and educational institutions, as well as through indirect channels. Oracle Corporation was founded in 1977 and is headquartered in Austin, Texas.",
    "industry": "Software",
    "ticker": "ORCL",
    "controversy": 2,
    "esg": 14,
    "esgEnvironment": 0.5,
    "esgSocial": 7.7,
    "esgGovernance": 5.7,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/50/Oracle_logo.svg/640px-Oracle_logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["oracle"]
  },
  {
    "name": "PepsiCo, Inc.",
    "description": "PepsiCo, Inc. manufactures, markets, distributes, and sells various beverages and convenient foods worldwide. The company operates through seven segments: Frito-Lay North America; Quaker Foods North America; PepsiCo Beverages North America; Latin America; Europe; Africa, Middle East and South Asia; and Asia Pacific, Australia and New Zealand and China Region. It provides dips, cheese-flavored snacks, and spreads, as well as corn, potato, and tortilla chips; cereals, rice, pasta, mixes and syrups, granola bars, grits, oatmeal, rice cakes, simply granola, and side dishes; beverage concentrates, fountain syrups, and finished goods; ready-to-drink tea, coffee, and juices; dairy products; and sparkling water makers and related products. The company offers its products primarily under the Lay's, Doritos, Cheetos, Gatorade, Pepsi-Cola, Mountain Dew, Quaker, Aquafina, Emperador, Diet Mountain Dew, Diet Pepsi, Gatorade Zero, Propel, Marias Gamesa, Ruffles, Sabritas, Saladitas, Tostitos, 7UP, Diet 7UP, H2oh!, Manzanita Sol, Mirinda, Pepsi Black, San Carlos, Toddy, Walkers, Chipsy, Kurkure, Sasko, Spekko, White Star, Smith's, Sting, SodaStream, Lubimy Sad, Pepsi, and other brands. It serves wholesale and other distributors, foodservice customers, grocery stores, drug stores, convenience stores, discount/dollar stores, mass merchandisers, membership stores, hard discounters, e-commerce retailers and authorized independent bottlers, and others through a network of direct-store-delivery, customer warehouse, and distributor networks, as well as directly to consumers through e-commerce platforms and retailers. The company was founded in 1898 and is based in Purchase, New York.",
    "industry": "Beverages",
    "ticker": "PEP",
    "controversy": 3,
    "esg": 16,
    "esgEnvironment": 4.9,
    "esgSocial": 6.6,
    "esgGovernance": 4.5,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f2/Pepsi_logo_for_Regal_Cinemas.svg/640px-Pepsi_logo_for_Regal_Cinemas.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["pepsi"]
  },
  {
    "name": "Walmart Inc.",
    "description": "Walmart Inc. engages in the operation of retail, wholesale, and other units worldwide. The company operates through three segments: Walmart U.S., Walmart International, and Sam's Club. It operates supercenters, supermarkets, hypermarkets, warehouse clubs, cash and carry stores, and discount stores under Walmart and Walmart Neighborhood Market brands; membership-only warehouse clubs; ecommerce websites, such as walmart.com, walmart.com.mx, walmart.ca, flipkart.com, and samsclub.com; and mobile commerce applications. The company offers grocery and consumables, including dry grocery, snacks, dairy, meat, produce, bakery and deli, alcoholic and nonalcoholic beverages, floral, candy, and other grocery items, as well as dry, chilled, or frozen packaged foods; and health and beauty aids, paper goods, laundry and home care, baby care, pet supplies, and other consumable items. It is also involved in the operation of gasoline stations; provision of tobacco; and health and wellness products covering pharmacy, optical and hearing services, and over-the-counter drugs and other medical products. In addition, the company offers home improvement, outdoor living, gardening, furniture, apparel, jewelry, tools and power equipment, housewares, toys, seasonal items, mattresses, and tire and battery centers; and consumer electronics and accessories, software, video games, office supplies, appliances, and third-party gift cards. Further, it operates digital payment platforms; and offers financial services and related products, including money transfers, bill payments, money orders, check cashing, prepaid access, co-branded credit cards, installment lending, and earned wage access. The company was formerly known as Wal-Mart Stores, Inc. and changed its name to Walmart Inc. in February 2018. Walmart Inc. was founded in 1945 and is based in Bentonville, Arkansas.",
    "industry": "Discount Stores",
    "ticker": "WMT",
    "controversy": 4,
    "esg": 25,
    "esgEnvironment": 4.4,
    "esgSocial": 13.9,
    "esgGovernance": 6.3,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ca/Walmart_logo.svg/640px-Walmart_logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["walmart", "walmart_text"]
  },
  {
    "name": "Visa Inc.",
    "description": "Visa Inc. operates as a payments technology company worldwide. The company operates VisaNet, a transaction processing network that enables authorization, clearing, and settlement of payment transactions. It also offers credit, debit, and prepaid card products; tap to pay, tokenization, click to pay; Visa Direct, a real-time payments network; Visa B2B Connect, a multilateral B2B cross-border payments network; Visa Treasury as a Service, a cross-border consumer payments business; and Visa DPS that provides a range of value added services, including fraud mitigation, dispute management, data analytics, campaign management, a suite of digital solutions, and contact center services. Further, the; company provides Cybersource, a payment management platform; and risk and identity solutions, such as Visa Advanced Authorization, Visa Secure, Visa Advanced Identity Score, and Visa Consumer Authentication Service; and Visa Consulting and Analytics, a payments consulting advisory services. It provides its services under the Visa, Visa Electron, Interlink, VPAY, and PLUS brands. The company serves consumers, merchants, financial institutions, and government entities. Visa Inc. was founded in 1958 and is headquartered in San Francisco, California.",
    "industry": "Credit Services",
    "ticker": "V",
    "controversy": 3,
    "esg": 16,
    "esgEnvironment": 0.7,
    "esgSocial": 7.8,
    "esgGovernance": 7.5,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5a/Visa_2014.svg/640px-Visa_2014.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["visa"]
  },
  {
    "name": "Microsoft Corporation",
    "description": "Microsoft Corporation develops, licenses, and supports software, services, devices, and solutions worldwide. The company operates in three segments: Productivity and Business Processes, Intelligent Cloud, and More Personal Computing. The Productivity and Business Processes segment offers Office, Exchange, SharePoint, Microsoft Teams, Office 365 Security and Compliance, Microsoft Viva, and Skype for Business; Skype, Outlook.com, OneDrive, and LinkedIn; and Dynamics 365, a set of cloud-based and on-premises business solutions for organizations and enterprise divisions. The Intelligent Cloud segment licenses SQL, Windows Servers, Visual Studio, System Center, and related Client Access Licenses; GitHub that provides a collaboration platform and code hosting service for developers; Nuance provides healthcare and enterprise AI solutions; and Azure, a cloud platform. It also offers enterprise support, Microsoft consulting, and nuance professional services to assist customers in developing, deploying, and managing Microsoft server and desktop solutions; and training and certification on Microsoft products. The More Personal Computing segment provides Windows original equipment manufacturer (OEM) licensing and other non-volume licensing of the Windows operating system; Windows Commercial, such as volume licensing of the Windows operating system, Windows cloud services, and other Windows commercial offerings; patent licensing; and Windows Internet of Things. It also offers Surface, PC accessories, PCs, tablets, gaming and entertainment consoles, and other devices; Gaming, including Xbox hardware, and Xbox content and services; video games and third-party video game royalties; and Search, including Bing and Microsoft advertising. The company sells its products through OEMs, distributors, and resellers; and directly through digital marketplaces, online stores, and retail stores. Microsoft Corporation was founded in 1975 and is headquartered in Redmond, Washington.",
    "industry": "Software",
    "ticker": "MSFT",
    "controversy": 3,
    "esg": 15,
    "esgEnvironment": 1.5,
    "esgSocial": 8.4,
    "esgGovernance": 5.3,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/96/Microsoft_logo_%282012%29.svg/640px-Microsoft_logo_%282012%29.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["microsoft"]
  },
  {
    "name": "T-Mobile US, Inc.",
    "description": "T-Mobile US, Inc., together with its subsidiaries, provides mobile communications services in the United States, Puerto Rico, and the United States Virgin Islands. The company offers voice, messaging, and data services to customers in the postpaid, prepaid, and wholesale and other services. It also provides wireless devices, including smartphones, wearables, tablets, home broadband routers, and other mobile communication devices, as well as wireless devices and accessories; financing through equipment installment plans; leasing through JUMP! On Demand; and High Speed Internet services. In addition, the company offers services, devices, and accessories under the T-Mobile and Metro by T-Mobile brands through its owned and operated retail stores, T-Mobile app and customer care channels, and its websites. It also sells its devices to dealers and other third-party distributors for resale through independent third-party retail outlets and various third-party websites. The company was founded in 1994 and is headquartered in Bellevue, Washington.",
    "industry": "Telecom Services",
    "ticker": "TMUS",
    "controversy": 3,
    "esg": 26,
    "esgEnvironment": 5,
    "esgSocial": 13.4,
    "esgGovernance": 7.7,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/f/f5/T-Mobile_US_Logo_2020_RGB_Magenta_on_Transparent.svg/640px-T-Mobile_US_Logo_2020_RGB_Magenta_on_Transparent.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["t-mobile"]
  },
  {
    "name": "Costco Wholesale Corporation",
    "description": "Costco Wholesale Corporation, together with its subsidiaries, engages in the operation of membership warehouses in the United States, Puerto Rico, Canada, the United Kingdom, Mexico, Japan, Korea, Australia, Spain, France, Iceland, China, and Taiwan. It offers branded and private-label products in a range of merchandise categories. The company offers sundries, dry groceries, candies, coolers, freezers, liquor, and tobacco and deli products; appliances, electronics, health and beauty aids, hardware, garden and patio products, sporting goods, tires, toys and seasonal products, office supplies, automotive care products, postages, tickets, apparel, small appliances, furniture, domestics, housewares, special order kiosks, and jewelry; and meat, produce, service deli, and bakery products. It also operates pharmacies, opticals, food courts, hearing-aid centers, and tire installation centers, gas stations; and offers business delivery, travel, same-day grocery, and various other services online in various countries. The company has warehouses in the United States, Puerto Rico, Canada, Mexico, Japan, the United Kingdom, South Korea, Taiwan, Australia, Spain, Iceland, France, and China. It also operates e-commerce websites in the United States, Canada, the United Kingdom, Mexico, South Korea, Taiwan, Japan, and Australia. The company was formerly known as Costco Companies, Inc. and changed its name to Costco Wholesale Corporation in August 1999. Costco Wholesale Corporation was founded in 1976 and is based in Issaquah, Washington.",
    "industry": "Discount Stores",
    "ticker": "COST",
    "controversy": 3,
    "esg": 24,
    "esgEnvironment": 7.3,
    "esgSocial": 11.2,
    "esgGovernance": 5.7,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/59/Costco_Wholesale_logo_2010-10-26.svg/640px-Costco_Wholesale_logo_2010-10-26.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["costco"]
  },
  {
    "name": "NIKE, Inc.",
    "description": "NIKE, Inc., together with its subsidiaries, designs, develops, markets, and sells men's, women's, and kids athletic footwear, apparel, equipment, and accessories worldwide. The company provides athletic and casual footwear, apparel, and accessories under the Jumpman trademark; and casual sneakers, apparel, and accessories under the Converse, Chuck Taylor, All Star, One Star, Star Chevron, and Jack Purcell trademarks. In addition, it sells a line of performance equipment and accessories comprising bags, socks, sport balls, eyewear, timepieces, digital devices, bats, gloves, protective equipment, and other equipment for sports activities under the NIKE brand; and various plastic products to other manufacturers. The company markets apparel with licensed college and professional team, and league logos, as well as sells sports apparel. Additionally, it licenses unaffiliated parties to manufacture and sell apparel, digital devices, and applications and other equipment for sports activities under NIKE-owned trademarks. The company sells its products to footwear stores; sporting goods stores; athletic specialty stores; department stores; skate, tennis, and golf shops; and other retail accounts through NIKE-owned retail stores, digital platforms, independent distributors, licensees, and sales representatives. The company was formerly known as Blue Ribbon Sports, Inc. and changed its name to NIKE, Inc. in 1971. NIKE, Inc. was founded in 1964 and is headquartered in Beaverton, Oregon.",
    "industry": "Footwear & Accessories",
    "ticker": "NIKE",
    "controversy": 3,
    "esg": 17,
    "esgEnvironment": 3,
    "esgSocial": 7,
    "esgGovernance": 6.9,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/3/36/Logo_nike_principal.jpg",
    "lastUpdated": 1661141873,
    "binding": ["nike", "nike_text"]
  },
  {
    "name": "The Coca-Cola Company",
    "description": "The Coca-Cola Company, a beverage company, manufactures, markets, and sells various nonalcoholic beverages worldwide. The company provides sparkling soft drinks, sparkling flavors; water, sports, coffee, and tea; juice, value-added dairy, and plant-based beverages; and other beverages. It also offers beverage concentrates and syrups, as well as fountain syrups to fountain retailers, such as restaurants and convenience stores. The company sells its products under the Coca-Cola, Diet Coke/Coca-Cola Light, Coca-Cola Zero Sugar, Diet Coke, Cherry Coke, Fanta Orange, Fanta Zero Orange, Fanta Zero Sugar, Fanta Apple, Sprite, Sprite Zero Sugar, Simply Orange, Simply Apple, Simply Grapefruit, Fresca, Schweppes, Thums Up, Aquarius, Ayataka, BODYARMOR, Ciel, Costa, Dasani, dogadan, FUZE TEA, Georgia, glacéau smartwater, glacéau vitaminwater, Gold Peak, Ice Dew, I LOHAS, Powerade, Topo Chico, AdeS, Del Valle, fairlife, innocent, Minute Maid, and Minute Maid Pulpy brands. It operates through a network of independent bottling partners, distributors, wholesalers, and retailers, as well as through bottling and distribution operators. The company was founded in 1886 and is headquartered in Atlanta, Georgia.",
    "industry": "Beverages",
    "ticker": "KO",
    "controversy": 3,
    "esg": 23,
    "esgEnvironment": 7.9,
    "esgSocial": 9.7,
    "esgGovernance": 4.9,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/ce/Coca-Cola_logo.svg/640px-Coca-Cola_logo.svg.png",
    "lastUpdated": 1661141873,
    "binding": ["cocacola", "coke"]
  },
  {
    "name": "adidas AG",
    "description": "adidas AG, together with its subsidiaries, designs, develops, produces, and markets athletic and sports lifestyle products in Europe, the Middle east, Africa, North America, Greater China, the Asia-Pacific, and Latin America. It offers footwear; apparel; and accessories and gear, such as bags and balls under the adidas brand. It sells its products through own retail stores; mono-branded franchise stores and shop-in-shops; and wholesale and its e-commerce channels. The company was formerly known as adidas-Salomon AG and changed its name to adidas AG in June 2006. adidas AG was founded in 1920 and is headquartered in Herzogenaurach, Germany.",
    "industry": "Footwear & Accessories",
    "ticker": "ADS.DE",
    "controversy": 3,
    "esg": 13,
    "esgEnvironment": 2.8,
    "esgSocial": 4.5,
    "esgGovernance": 6.1,
    "imageURL": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/24/Adidas_logo.png/640px-Adidas_logo.png",
    "lastUpdated": 1661141873,
    "binding": ["adidas", "adidas1"]
  }
]
